Documents/ОтчетКомиссионера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ОтчетКомиссионера</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетКомиссионера/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

  	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
    ЗаполнитьКэшДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	ОтобразитьЦветВалюты();
	
    ОтобразитьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры 

#КонецОбласти 


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	//Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	//Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	//Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	//
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера();

	//если уже есть такой товар, зачем искать цену
	ЕстЦен = 0;
	Если Объект.Товары.Количество() <> 0 Тогда
		//Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		//Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		//ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИтоги()

	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект); 
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)

	ОтобразитьЦветВалюты();

КонецПроцедуры
 
 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли;
	ОтобразитьИтоги();
	
КонецПроцедуры


#КонецОбласти 


#Область ДействияТабличнойЧасти

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура("Склад", Объект.Склад);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	//ЗаполнитьРеквизитыПоСерии(ТекДанные, ТекДанные.Серия);
	
	СписокПартий = ОстаткиПартий(ТекДанные.Серия);        
	КолвоПартий = СписокПартий.Количество();
	Если КолвоПартий = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ТекДанные.Серия + "!");
		Возврат;
	ИначеЕсли КолвоПартий > 1 Тогда
		Сигнал();
		//Эле = СписокПартий.ВыбратьЭлемент("Найдено несколько партий с такой серией, выберите:");
		//Если Эле = Неопределено Тогда Возврат КонецЕсли;
		//ТекПартия = Эле.Значение;
		ВыбратьВариант(СписокПартий);
	Иначе
		//ТекПартия = СписокПартий[0]; 
		ЗаполнитьРеквизитыПоСерии(ТекДанные, СписокПартий.Получить(0).Значение); 
     КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоСерии(СтрокаТЧ, СтруктураДанных)
	
	СтрокаТЧ.Номенклатура 	= СтруктураДанных.Номенклатура;
	СтрокаТЧ.Партия 		= СтруктураДанных.Партия;  
	//СтрокаТЧ.Цена 			= СтруктураДанных.Цена;
	СтрокаТЧ.Количество 	= 1;
	//СтрокаТЧ.Сумма			= СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	
КонецПроцедуры

&НаСервере
Функция ОстаткиПартий(Серия)
	
	спис = Новый СписокЗначений;
	ТаблицаПартий =	Комиссия.ОстаткиПартийНаКомиссии(Серия, Объект.Ссылка.МоментВремени(), Объект.Фирма, Объект.СкладКомиссии);
	Для каждого парт Из ТаблицаПартий Цикл
		СтруктураПартии = Новый Структура("Номенклатура,ИмяНоменклатуры,Партия,Количество,Сумма,СуммаКомиссионера");
		ЗаполнитьЗначенияСвойств(СтруктураПартии, парт);
		спис.Добавить(СтруктураПартии, парт.ИмяНоменклатуры);	
	КонецЦикла;	
    Возврат спис;
	
КонецФункции // ()

&НаКлиенте
Процедура ВыбратьВариант(СписокВариантов) Экспорт

	// Создаем описание оповещения. 
	// 1-й параметр: Имя процедуры, которая сработает после закрытия
	// 2-й параметр: Модуль, где находится эта процедура (ЭтаФорма)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораВарианта", ЭтаФорма);
	
	// Открываем форму. ОписаниеОповещения передается 7-м параметром  
	ПараметрыОткрытия = Новый Структура("Список, Заголовок", СписокВариантов, НСтр("ru = 'Выберите партию'; en = 'Select tha batch'"));
	ОткрытьФорму("ОбщаяФорма.ВыборПростогоВарианта", ПараметрыОткрытия, ЭтаФорма, , , , ОповещениеОЗакрытии);	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораВарианта(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ЗаполнитьРеквизитыПоСерии(Элементы.Товары.ТекущиеДанные, РезультатЗакрытия.ВыбранноеЗначение)
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОтобразитьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ОтобразитьИтоги();
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
		
	// 1. Отключаем предыдущий вызов, чтобы они не накапливались при быстром скроллинге
    ОтключитьОбработчикОжидания("ОбновитьИнфоСтрокуАсинхронно");
    
    // 2. Подключаем обработчик однократно с задержкой 0.2 секунды
    ПодключитьОбработчикОжидания("ОбновитьИнфоСтрокуАсинхронно", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнфоСтрокуАсинхронно()
    
    ТекДанные = Элементы.Товары.ТекущиеДанные;
    
    Если ТекДанные = Неопределено Тогда 
        Элементы.ДекорацияИнфоСтроки.Заголовок = "";
        Возврат;
    КонецЕсли;
    
    Ит = 0;
    НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекДанные.Номенклатура));
    Для каждого НайдСтрока Из НайдСтроки Цикл
        Ит = Ит + НайдСтрока.Количество;
    КонецЦикла;
    
    Если Ит > 0 Тогда
        Стр = СтрШаблон("%1: %2", 
                        НСтр("ru = 'Количество товара текущей строки'; en = 'Quantity of the current line good'"),
                        омСервер.Фрмт(Ит, "ЧИСЛОЦЕЛ_ЦВ1"));
                        
        Элементы.ДекорацияИнфоСтроки.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(Стр));                
    Иначе
        Элементы.ДекорацияИнфоСтроки.Заголовок = "";
    КонецЕсли;    
    
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПартияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Серия = гоРеквизит(ТекДанные.Партия, "Серия");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
    ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные.Количество = 0 Тогда
	 	ТекДанные.Количество = 1;
	КонецЕсли;	
	ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
    ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	
КонецПроцедуры

#КонецОбласти
